20160330-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-29 Fr 10:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Arne Brasseur" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline21">1. Emacs Meetup Berlin 30. March 2016</a>
<ul>
<li><a href="#orgheadline1">1.1. Search</a></li>
<li><a href="#orgheadline2">1.2. It is hard(?) to change indentation in JavaScript</a></li>
<li><a href="#orgheadline3">1.3. How to use chrome</a></li>
<li><a href="#orgheadline4">1.4. All the different kill ring/clip boards are confusing</a></li>
<li><a href="#orgheadline5">1.5. try expand region</a></li>
<li><a href="#orgheadline6">1.6. try easy kill</a></li>
<li><a href="#orgheadline7">1.7. Emacs has great support for right-to-left languages</a></li>
<li><a href="#orgheadline8">1.8. Emojis in emacs</a></li>
<li><a href="#orgheadline9">1.9. Try auto-revert-mode</a></li>
<li><a href="#orgheadline10">1.10. True global-mark-ring</a></li>
<li><a href="#orgheadline11">1.11. What's up with ivy?</a></li>
<li><a href="#orgheadline12">1.12. Who is using etags/ctags</a></li>
<li><a href="#orgheadline13">1.13. Pronouncing stuff</a></li>
<li><a href="#orgheadline14">1.14. Try M-x butterfly</a></li>
<li><a href="#orgheadline15">1.15. ed is the standrad text editor</a></li>
<li><a href="#orgheadline16">1.16. Youtube talks</a></li>
<li><a href="#orgheadline17">1.17. Helm swoop edit: edit suff that matches</a></li>
<li><a href="#orgheadline18">1.18. try helm-swoop</a></li>
<li><a href="#orgheadline19">1.19. try fzf command line tool</a></li>
<li><a href="#orgheadline20">1.20. try keyfreq</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-2">
<h2 id="orgheadline21"><span class="section-number-2">1</span> Emacs Meetup Berlin 30. March 2016</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Search</h3>
<div class="outline-text-3" id="text-1-1">
<p>
-try git-grep for helm projectile grep
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> It is hard(?) to change indentation in JavaScript</h3>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> How to use chrome</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>try update-alternatives</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> All the different kill ring/clip boards are confusing</h3>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> try expand region</h3>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.6</span> try easy kill</h3>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.7</span> Emacs has great support for right-to-left languages</h3>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.8</span> Emojis in emacs</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>:poop:</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">1.9</span> Try auto-revert-mode</h3>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">1.10</span> True global-mark-ring</h3>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">1.11</span> What's up with ivy?</h3>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">1.12</span> Who is using etags/ctags</h3>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">1.13</span> Pronouncing stuff</h3>
<div class="outline-text-3" id="text-1-13">
<ul class="org-ul">
<li>gif</li>
<li>png</li>
<li>glibc</li>
<li>gnome</li>
<li>magit</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">1.14</span> Try M-x butterfly</h3>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">1.15</span> ed is the standrad text editor</h3>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">1.16</span> Youtube talks</h3>
<div class="outline-text-3" id="text-1-16">
<ul class="org-ul">
<li>parens of the death</li>
<li>paredit by emacsrocks</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">1.17</span> Helm swoop edit: edit suff that matches</h3>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">1.18</span> try helm-swoop</h3>
</div>
<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">1.19</span> try fzf command line tool</h3>
</div>
<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">1.20</span> try keyfreq</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arne Brasseur</p>
<p class="date">Created: 2016-04-29 Fr 10:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
